[
  {
    "Code": "A.5.1",
    "Section": "Organizational controls",
    "Control": "Policies for information security",
    "Requirements": "A set of policies for information and cybersecurity shall be defined, approved by C-level, published and communicated to employees and relevant external parties.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.2",
    "Section": "Organizational controls",
    "Control": "Information security roles and responsibilities",
    "Requirements": "All information and cybersecurity roles and responsibilities shall be defined and allocated.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.3",
    "Section": "Organizational controls",
    "Control": "Segregation of duties",
    "Requirements": "Conflicting tasks and areas of responsibility should be separated to reduce opportunities to change or misuse the assets of the organization without permission or unintended.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.4",
    "Section": "Organizational controls",
    "Control": "Management responsibilities",
    "Requirements": "Management should mandate all employees and contractors to exercise information security in accordance with established policies and procedures set by the organization.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.5",
    "Section": "Organizational controls",
    "Control": "Contact with authorities",
    "Requirements": "It is necessary to maintain proper communications with the relevant authorities.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.6",
    "Section": "Organizational controls",
    "Control": "Contact with special interest groups",
    "Requirements": "Appropriate connections should be established with special interest organizations or other forums for professional security and professional associations.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.7",
    "Section": "Organizational controls",
    "Control": "Threat intelligence",
    "Requirements": "Collect and analyse information relating to information security threats and use that information take mitigation action.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.8",
    "Section": "Organizational controls",
    "Control": "Information security in projectmanagement",
    "Requirements": "Throughout project management, the confidentiality of information should be discussed irrespective of project type.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.9",
    "Section": "Organizational controls",
    "Control": "Inventory of information and other associated assets",
    "Requirements": "Assets related to information and information facilities of an organization should be identified and listed, inventory of these assets should also be maintained. And assets in the inventory should have their owners (Asset-owner).",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.10",
    "Section": "Organizational controls",
    "Control": "Acceptable use of information and other associated assets",
    "Requirements": "Rules should be identified, documented, and implemented for the acceptable use of information and assets linked to information and information processing facilities. Handling of assets in accordance with the organization’s information classification scheme should be developed and implemented.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.11",
    "Section": "Organizational controls",
    "Control": "Return of assets",
    "Requirements": "Both workers and external stakeholders must return all the organizational assets in their possession upon termination of their job, contract or agreement.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.12",
    "Section": "Organizational controls",
    "Control": "Classification of information",
    "Requirements": "Information should be classification in the basis of their legal provisions, criticality, and vulnerability to unwanted release or alteration.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.13",
    "Section": "Organizational controls",
    "Control": "Labelling of information",
    "Requirements": "In accordance with the information classification scheme adopted by the organization, an adequate set of methods for labelling information should be established and implemented.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.14",
    "Section": "Organizational controls",
    "Control": "Information transfer",
    "Requirements": "In order to protect the transferees by using all types of communication facilities, official transfer policies, procedures and controls should be developed. Agreements sElectronic messaging information should be adequately protected.hould address secure transfers between the organization and outside parties of business information. ",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.15",
    "Section": "Organizational controls",
    "Control": "Access control",
    "Requirements": "An access control policy with supporting business and information security requirements should be established, documented, and reviewed. Only network and network facilities which have expressly been approved for use will be made available to users.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.16",
    "Section": "Organizational controls",
    "Control": "Identity management",
    "Requirements": "Only network and network facilities which have expressly been approved for use will be made available to users.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.17",
    "Section": "Organizational controls",
    "Control": "Authentication information",
    "Requirements": "A structured management process should control the allocation of secret authentication information. Use of secret authentication information should be allowed for users to follow the organization’s practices. Password management systems should be cooperative to ensure the quality of the passwords.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.18",
    "Section": "Organizational controls",
    "Control": "Access rights",
    "Requirements": "A formal process for granting access to users should be put in place to grant or remove access privileges for all categories of users to all systems and services. Access rights of users should be reviewed regularly by asset owners. Access rights of all employees and external users to information and information processing facilities should be waived upon termination of jobs, contract or agreement, or changed upon adjustment.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.19",
    "Section": "Organizational controls",
    "Control": "Information security in supplier relationships",
    "Requirements": "The supplier should be agreed with and documented information security requirements related to the risk mitigation of access by suppliers to organizational assets.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.20",
    "Section": "Organizational controls",
    "Control": "Addressing information security within supplier agreements",
    "Requirements": "Any suppliers that view, process, store, communicate or provide IT infrastructure component information for the organization should be defined and agreed with all applicable information security requirements.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.21",
    "Section": "Organizational controls",
    "Control": "Managing information security in the information \nand communication technology (ICT) supply-chain",
    "Requirements": "Supplier agreements will contain provisions to mitigate information security risks associated with IT Services and the product supply chain.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.22",
    "Section": "Organizational controls",
    "Control": "Monitoring, review and change management of supplier services",
    "Requirements": "Organizations shall monitor, review and audit the provision of service to suppliers on a regular basis. Change in the provision of services by providers should be managed with the focus on the criticality of enterprise information, systems, processes, and reassessment of risks and should include maintaining and improving existing information security policies, procedures, and controls.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.23",
    "Section": "Organizational controls",
    "Control": "Information security for use of cloud services",
    "Requirements": "Set security requirements for cloud services in order to have better protection of your information in the cloud. This includes purchasing, using, managing, and terminating the use of cloud services.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.24",
    "Section": "Organizational controls",
    "Control": "Information security incident management planning and preparation",
    "Requirements": "In order to ensure a quick, efficient, and organized response to Information Security Incident Management roles and procedures should be defined.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.25",
    "Section": "Organizational controls",
    "Control": "Assessment and decision on information security events",
    "Requirements": "Information security events should be analyzed and determined whether they should be listed as incidents related to information security.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.26",
    "Section": "Organizational controls",
    "Control": "Response to information security incidents",
    "Requirements": "In the context of the documented procedures, information security incidents should be responded to.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.27",
    "Section": "Organizational controls",
    "Control": "Learning from information security incidents",
    "Requirements": "To minimize the risk or effect of potential accidents, the experience obtained from the study and mitigation of information security accidents should be used.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.28",
    "Section": "Organizational controls",
    "Control": "Collection of evidence",
    "Requirements": "The organization will define, obtain, procure and retain information as documentation and implement procedures.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.29",
    "Section": "Organizational controls",
    "Control": "Information security during disruption",
    "Requirements": "In adverse circumstances, e.g. during a crisis or a catastrophe, the company will determine the information securityIn order to ensure the necessary degree of consistency of information security to adverse circumstances, the company should define, document, execute, and maintain processes, procedures, and controls.  standards and consistency of information security management. In order to ensure accurate and productive to adverse circumstances, the company must review on-going controls on safety information defined and enforced at regular intervals.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.30",
    "Section": "Organizational controls",
    "Control": "ICT readiness for business continuity",
    "Requirements": "Information and communication technology to be ready for potential disruptions so that required information and assets are available when needed. This includes readiness planning, implementation, maintenance, and testing.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.31",
    "Section": "Organizational controls",
    "Control": "Legal, statutory, regulatory and contractual requirements",
    "Requirements": "Each of information systems and organizations should specifically identify, document, and update all relevant statutory, regulatory, contractual requirements, and the approach of the organization towards compliance with these requirements. In accordance with all relevant agreements, legislation, and regulations, cryptographic controls must be used.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.32",
    "Section": "Organizational controls",
    "Control": "Intellectual property rights",
    "Requirements": "Proper procedures will be followed to ensure that the legal, regulatory, and contractual provisions relating to ownership of intellectual property and the use of proprietary software products are complied upon.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.33",
    "Section": "Organizational controls",
    "Control": "Protection of records",
    "Requirements": "In accordance with the provisions to legislative, regulatory, contractual, and business requirements, to protect from loss, destruction, falsification, and unauthorized access and unauthorized release.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.34",
    "Section": "Organizational controls",
    "Control": "Privacy and protection of personal identifiable information (PII)",
    "Requirements": "Privacy and protection of personal data should be guaranteed, as required, in applicable laws and regulations.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.35",
    "Section": "Organizational controls",
    "Control": "Independent review of information security",
    "Requirements": "Each of these information systems and organizations should specifically identify, document, and update all relevant statutory, regulatory, contractual requirements, and the approach of the organization towards compliance with these requirements.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.36",
    "Section": "Organizational controls",
    "Control": "Compliance with policies, rules and standards for information security",
    "Requirements": "Proper procedures will be followed to ensure that the legal, regulatory, and contractual provisions relating to ownership of intellectual property and the use of proprietary software products are complied upon. Information systems for compliance with the Information Security Policies and practices of an organization should be periodically reviewed.",
    "Status": "Unknown"
  },
  {
    "Code": "A.5.37",
    "Section": "Organizational controls",
    "Control": "Documented operating procedures",
    "Requirements": "Operating procedures should be documented and accessed by all users in need.",
    "Status": "Unknown"
  },
  {
    "Code": "A.6.1",
    "Section": "People controls",
    "Control": "Screening",
    "Requirements": "Background verification checks on all job applicants will be performed in compliance with applicable rules, legislation, and ethics and should be proportionate to business criteria, classification of the information to be obtained, and potential risks.",
    "Status": "Unknown"
  },
  {
    "Code": "A.6.2",
    "Section": "People controls",
    "Control": "Terms and conditions of employment",
    "Requirements": "Contract agreements with employees and contractors would set out their responsibility for information security, and hence the responsibility of the company.",
    "Status": "Unknown"
  },
  {
    "Code": "A.6.3",
    "Section": "People controls",
    "Control": "Information security awareness, education and training",
    "Requirements": "All company workers and, where necessary, contractors will receive adequate awareness education and training, as well as daily updates on organizational policies and procedures, as applicable to their job function.",
    "Status": "Unknown"
  },
  {
    "Code": "A.6.4",
    "Section": "People controls",
    "Control": "Disciplinary process",
    "Requirements": "A formal and informed administrative process will be in place to take action against employees who have committed an information security breach.",
    "Status": "Unknown"
  },
  {
    "Code": "A.6.5",
    "Section": "People controls",
    "Control": "Responsibilities after termination or change of employment",
    "Requirements": "Responsibility and information/cyber security requirements that continue to be valid following termination or change of employment must be defined, communicated to, and implemented by the employee or contractor.",
    "Status": "Unknown"
  },
  {
    "Code": "A.6.6",
    "Section": "People controls",
    "Control": "Confidentiality or non-disclosure agreements",
    "Requirements": "Information protection requirements of the organization for confidentiality or non-disclosure agreements should be identified, regularly reviewed, and documented.",
    "Status": "Unknown"
  },
  {
    "Code": "A.6.7",
    "Section": "People controls",
    "Control": "Remote working",
    "Requirements": "To guard the accessed, processed, or stored information at remote sites, a policy and supporting security measures should be implemented.",
    "Status": "Unknown"
  },
  {
    "Code": "A.6.8",
    "Section": "People controls",
    "Control": "Information security event reporting",
    "Requirements": "Information security incidents should be reported as quickly as possible through appropriate management channels. Any information security vulnerabilities found or suspected in systems or services in which employees and contractors are using the information systems and services of the organization should be recorded and documented.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.1",
    "Section": "Physical controls",
    "Control": "Physical security perimeters",
    "Requirements": "Security perimeters should be established in order to secure areas that contain either sensitive or confidential information and information processing facilities.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.2",
    "Section": "Physical controls",
    "Control": "Physical entry",
    "Requirements": "Appropriate access controls should protect places to ensure that only authorized employees are allowed access. It is important to track and, where possible, differentiate between access points such as the distribution and loading areas and other locations in order to avoid unauthorized access by unauthorized persons to the premises.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.3",
    "Section": "Physical controls",
    "Control": "Securing offices, rooms and facilities",
    "Requirements": "Physical security should be designed and implemented for the offices, rooms, and facilities.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.4",
    "Section": "Physical controls",
    "Control": "Physical security monitoring",
    "Requirements": "Monitor sensitive areas in order to enable only authorized people to access them. This might include your offices, production facilities, warehouses, and other premises.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.5",
    "Section": "Physical controls",
    "Control": "Protecting against physical and environmental threats",
    "Requirements": "Physical protection should be designed and applied against natural disasters, malicious attacks or accidents.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.6",
    "Section": "Physical controls",
    "Control": "Working in secure areas",
    "Requirements": "Procedures should be designed and implemented for working in safe areas.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.7",
    "Section": "Physical controls",
    "Control": "Clear desk and clear screen",
    "Requirements": "A clear desk policy should be adopted for papers and removable storage media and a clear screen policy should be applied to information processing facilities.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.8",
    "Section": "Physical controls",
    "Control": "Equipment siting and protection",
    "Requirements": "To mitigate the risk of environmental hazards, risks, and unauthorized access, the equipment should be sited and secured.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.9",
    "Section": "Physical controls",
    "Control": "Security of assets off-premises",
    "Requirements": "The security of off-site assets should be applied to the various risks of working outside the premises of the organization in mind.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.10",
    "Section": "Physical controls",
    "Control": "Storage media",
    "Requirements": "Procedures shall be implemented for the management of removable media in accordance with the classification scheme adopted by the organization. When not required by specific protocols, media should be disposed of securely. Information media should be protected from unauthorized access, misuse or corruption during transportation. Without prior authorization, equipment, information, or software should not be taken off-site.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.11",
    "Section": "Physical controls",
    "Control": "Supporting utilities",
    "Requirements": "Equipment should be secured against power failures and other disruptions caused by the supporting infrastructure failures.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.12",
    "Section": "Physical controls",
    "Control": "Cabling security",
    "Requirements": "Cable for power and telecommunications that carry data or support services should be safeguarded against interception, interference, or damage.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.13",
    "Section": "Physical controls",
    "Control": "Equipment maintenance",
    "Requirements": "To ensure its continued availability and integrity, the equipment should be correctly maintained.",
    "Status": "Unknown"
  },
  {
    "Code": "A.7.14",
    "Section": "Physical controls",
    "Control": "Secure disposal or re-use of equipment",
    "Requirements": "To avoid the removal or overriding of sensitive data and software by the disposal or reuse of any device containing storage medium, all devices must be reviewed.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.1",
    "Section": "Technological controls",
    "Control": "User end point devices",
    "Requirements": "To manage the risks introduced by the use of mobile devices, a policy and supporting safety measures should be adopted. Unattended equipment should be adequately protected by users.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.2",
    "Section": "Technological controls",
    "Control": "Privileged access rights",
    "Requirements": "A structured authorizing procedure in accordance with the appropriate access management policies should monitor the allocation and usage of delegated access privileges.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.3",
    "Section": "Technological controls",
    "Control": "Information access restriction",
    "Requirements": "Access controls should be based on individual requirements for business applications and in compliance with a specified access control policy.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.4",
    "Section": "Technological controls",
    "Control": "Access to source code",
    "Requirements": "Access should be limited to the source code of the program.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.5",
    "Section": "Technological controls",
    "Control": "Secure authentication",
    "Requirements": "Access to systems and applications should be controlled by a secure log-on procedure when required by the Access Control Policy.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.6",
    "Section": "Technological controls",
    "Control": "Capacity management",
    "Requirements": "In order to ensure necessary system performance, the use of resources should be monitored, adapted, and projected based on future capacity requirements.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.7",
    "Section": "Technological controls",
    "Control": "Protection against malware",
    "Requirements": "In combination with appropriate user awareness, the detection, prevention, and recovery controls to protect against malware should be implemented.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.8",
    "Section": "Technological controls",
    "Control": "Management of technical vulnerabilities",
    "Requirements": "Information on technological vulnerabilities of information systems used should be obtained in a timely manner, the exposure of the organization to such vulnerabilities should be assessed and appropriate measures taken to address the risk involved. Information systems for compliance with the Information Security Policies and practices of an organization should be periodically reviewed.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.9",
    "Section": "Technological controls",
    "Control": "Configuration management",
    "Requirements": "Manage the whole cycle of security configuration for your technology to ensure a proper level of security and to avoid any unauthorized changes. This includes configuration definition, implementation, monitoring, and review.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.10",
    "Section": "Technological controls",
    "Control": "Information deletion",
    "Requirements": "Delete data when no longer required, in order to avoid leakage of sensitive information and to enable compliance with privacy and other requirements. This could include deletion in your IT systems, removable media, or cloud services.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.11",
    "Section": "Technological controls",
    "Control": "Data masking",
    "Requirements": "Use data masking together with access control in order to limit the exposure of sensitive information. This primarily means personal data, because they are heavily regulated through privacy regulations, but it could also include other categories of sensitive data.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.12",
    "Section": "Technological controls",
    "Control": "Data leakage prevention",
    "Requirements": "Apply various data leakage measures in order to avoid unauthorized disclosure of sensitive information, and if such incidents happen, to detect them in a timely manner. This includes information in IT systems, networks, or any devices.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.13",
    "Section": "Technological controls",
    "Control": "Information backup",
    "Requirements": "In accordance with the agreed backup policy, copies of records, program and device images shall be collected and regularly tested.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.14",
    "Section": "Technological controls",
    "Control": "Redundancy of information processing facilities",
    "Requirements": "How information processing facilities are implemented with redundancy sufficiency to meet availability requirements. Redundancy refers to implementing, typically, duplicate hardware to ensure availability of information processing systems.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.15",
    "Section": "Technological controls",
    "Control": "Logging",
    "Requirements": "Event logs should be produced, retained, and regularly reviewed to record user activities, exceptions, defects, and information security events. Logging and log information should be secure from intrusion and unauthorized access. The activity of the System Manager and System Operator is to be logged, and the logs kept safe and monitored closely.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.16",
    "Section": "Technological controls",
    "Control": "Monitoring activities",
    "Requirements": "Monitor systems in order to recognize unusual activities and, if needed, to activate the appropriate incident response. This includes monitoring of your IT systems, networks, and applications.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.17",
    "Section": "Technological controls",
    "Control": "Clock synchronization",
    "Requirements": "Clocks in all related information management systems should be integrated into a single reference time source for an organization or safety domain.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.18",
    "Section": "Technological controls",
    "Control": "Use of privileged utility programs",
    "Requirements": "The use of utility programs that could bypass system and application controls should be limited and tightly controlled.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.19",
    "Section": "Technological controls",
    "Control": "Installation of software on operational systems",
    "Requirements": "To control the installation of software on operating systems, procedures should be implemented. Users should set and implement rules governing software installation.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.20",
    "Section": "Technological controls",
    "Control": "Networks security",
    "Requirements": "To protect information in systems and applications, networks should be managed and monitored.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.21",
    "Section": "Technological controls",
    "Control": "Security of network services",
    "Requirements": "Security protocols, quality of service, and management criteria for all network services, whether in-house or outsourced, should be defined and included in-network services agreements.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.22",
    "Section": "Technological controls",
    "Control": "Segregation of networks",
    "Requirements": "Network segregation should be established for information services, users, and information systems.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.23",
    "Section": "Technological controls",
    "Control": "Web filtering",
    "Requirements": "Manage which websites users are accessing, in order to protect your IT systems. This way, you can prevent your systems from being compromised by malicious code, and also prevent users from using illegal materials from the Internet.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.24",
    "Section": "Technological controls",
    "Control": "Use of cryptography",
    "Requirements": "A policy on the use of cryptographic controls for protection of information shall be developed and implemented. A policy on the use, security, and lifetime of cryptographic keys should be created and enforced over their entire life cycle.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.25",
    "Section": "Technological controls",
    "Control": "Secure development life cycle",
    "Requirements": "Changes to processes can be managed through the implementation of structured change control procedures within the software lifecycle.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.26",
    "Section": "Technological controls",
    "Control": "Application security requirements",
    "Requirements": "Application services which pass through public networks should be protected against fraudulent activities, contract disputes, unauthorized disclosure, and modification. In order to avoid incomplete transmission, misrouting, unauthorized messaging modification, unauthorized dissemination, unauthorized message replication, or replay, information concerning application service transactions should be covered.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.27",
    "Section": "Technological controls",
    "Control": "Secure system architecture and engineering principles",
    "Requirements": "In the implementation of any information system implementation project, standards for secure system engineered must be established, documented, maintained, and implemented.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.28",
    "Section": "Technological controls",
    "Control": "Secure coding",
    "Requirements": "Establish secure coding principles and apply them to your software development in order to reduce security vulnerabilities in the software. This could include activities before, during, and after the coding.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.29",
    "Section": "Technological controls",
    "Control": "Security testing in development and acceptance",
    "Requirements": "During development, security functionality test should be conducted. New information systems, enhancements, and updated versions should be equipped with acceptance testing services and related requirements.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.30",
    "Section": "Technological controls",
    "Control": "Outsourced development",
    "Requirements": "The organization must monitor activity for the development of the outsourced system.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.31",
    "Section": "Technological controls",
    "Control": "Separation of development, test and production environments",
    "Requirements": "It is important to define and enforce the degree of separation between organizational, testing and development environments needed to avoid operational problems. Organizations should create secure development environments and integration efforts for the entire life cycle of system development, and should be adequately protected.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.32",
    "Section": "Technological controls",
    "Control": "Change management",
    "Requirements": "Changes in the organization, organizational procedures, information management facilities, and information security systems should be controlled. Changes to processes can be managed through the implementation of structured change control procedures within the software lifecycle. In changing operating platforms, critical applications of business should be revised and tested to ensure no adverse impacts on business or security. Software package modifications should be discouraged, restricted to the modifications necessary, and all changes controlled strictly.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.33",
    "Section": "Technological controls",
    "Control": "Test information",
    "Requirements": "Careful collection, security, and review of test data should be performed.",
    "Status": "Unknown"
  },
  {
    "Code": "A.8.34",
    "Section": "Technological controls",
    "Control": "Protection of information systems during audit testing",
    "Requirements": "The audit criteria and activities related to operating system verification should be carefully prepared and decided in order to reduce business process disturbance.",
    "Status": "Unknown"
  }
]
